In [9]:
import pandas as pd

In [19]:
dict1 = {
    'name': ["Harry","Rohan","Skillf","Shubh"], 
    'marks': [92,34,24,17],
    "city": ["Rampur","Kolkata","Bareilly","Antartica"]
    
    
}

In [21]:
df= pd.DataFrame(dict1)

In [22]:
df

     name  marks       city
0   Harry     92     Rampur
1   Rohan     34    Kolkata
2  Skillf     24   Bareilly
3   Shubh     17  Antartica

In [27]:
# loc allows to access the elements of df

df.to_csv('dict1.csv',index = True)

Reading  data  from  .csv

In [31]:
# head is the function which is used to retrive info of n instances

df.head(2)

    name  marks     city
0  Harry     92   Rampur
1  Rohan     34  Kolkata

In [33]:
# head is the function which is used to retrive info from  n number  instances

df.tail(1)

    name  marks       city
3  Shubh     17  Antartica

In [34]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

*describe()* in pd 
pd.describe()


method used to generate descriptive statistics of a DataFrame or Series. This method provides a summary that includes metrics such as count, mean, standard deviation, minimum and maximum values, and the quartiles for numeric data.

In [36]:
document1 = pd.read_csv("dict1.csv")

In [41]:
document1["name"][1] =  "Harry"

C:\Users\M Saipavan\AppData\Local\Temp\ipykernel_12204\2601129113.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  document1["name"][1] =  "Harry"

In [42]:
document1.to_csv("document1.csv")

In [43]:
document1.index = ["first","second","third","fourth"]

In [44]:
document1

        Unnamed: 0    name  marks       city
first            0   Harry     92     Rampur
second           1   Harry     34    Kolkata
third            2  Skillf     24   Bareilly
fourth           3   Shubh     17  Antartica